<template>
  <div class="nav-cantainer mt-5">
    <form @submit.prevent="setLocation">
      <select name="city" id="city" v-model.trim="city" class="form-select">
        <option selected :value="geoCity[0].name" :key="geoCity[0].name">{{ geoCity[0].name }}</option>
        <option v-for="geo in geoCity.slice(1)" :key="geo.name" :value="geo.name">{{ geo.name }}</option>
      </select>
      <select name="district" id="district" v-model.trim="district" class="form-select">
        <option value="" selected>시/군/구</option>
        <option v-for="(dis, name) in geoLocation[city]" :key="name" :value="name">{{ name.replace('_', ' ') }}</option>
      </select>
      <select name="brand" id="brand" v-model.trim="brand" class="form-select">
        <option value="국민은행" selected>국민은행</option>
        <option value="신한은행">신한은행</option>
        <option value="우리은행">우리은행</option>
        <option value="하나은행">하나은행</option>
        <option value="KDB산업은행">산업은행</option>
        <option value="기업은행">기업은행</option>
        <option value="농협">농협</option>
        <option value="새마을금고">새마을금고</option>
        <option value="신협">신협</option>
        <option value="수협">수협</option>
        <option value="우체국">우체국</option>
        <option value="부산은행">부산은행</option>
        <option value="대구은행">대구은행</option>
        <option value="광주은행">광주은행</option>
        <option value="경남은행">경남은행</option>
        <option value="전북은행">경남은행</option>
        <option value="제주은행">전북은행</option>
      </select>
      <button class="btn">검색</button>
    </form>
  </div>
</template>

<script setup>
import { ref, watch } from 'vue'
const emit = defineEmits(['setLocation'])
const city = ref('서울특별시')
const district = ref('')
const brand = ref('국민은행')
const geoCity = [
  { name: '서울특별시' },
  { name: '인천광역시' },
  { name: '대전광역시' },
  { name: '부산광역시' },
  { name: '대구광역시' },
  { name: '광주광역시' },
  { name: '울산광역시' },
  { name: '경기도' },
  { name: '강원도' },
  { name: '충청북도' },
  { name: '충청남도' },
  { name: '전라북도' },
  { name: '전라남도' },
  { name: '경상북도' },
  { name: '경상남도' },
  { name: '제주도' },
  { name: '세종시' },
]
const geoLocation = {
  서울특별시: {
    강남구: { x: 37.5130981, y: 127.0469643, level: 6 },
    강동구: { x: 37.5501232, y: 127.146148, level: 6 },
    강북구: { x: 37.6356772, y: 127.0238386, level: 6 },
    강서구: { x: 37.5619185, y: 126.826919, level: 6 },
    관악구: { x: 37.4784413, y: 126.9410529, level: 6 },
    광진구: { x: 37.546693, y: 127.086132, level: 6 },
    구로구: { x: 37.4968922, y: 126.885956, level: 6 },
    금천구: { x: 37.4651014, y: 126.9000078, level: 6 },
    노원구: { x: 37.6574151, y: 127.0678763, level: 6 },
    도봉구: { x: 37.6579414, y: 127.0388221, level: 6 },
    동대문구: { x: 37.581381, y: 127.048958, level: 6 },
    동작구: { x: 37.503072, y: 126.947753, level: 6 },
    마포구: { x: 37.5555485, y: 126.9183198, level: 6 },
    서대문구: { x: 37.5719319, y: 126.9429294, level: 6 },
    서초구: { x: 37.49184, y: 127.007688, level: 6 },
    성동구: { x: 37.560722, y: 127.034766, level: 6 },
    성북구: { x: 37.60266, y: 127.013494, level: 6 },
    송파구: { x: 37.501187, y: 127.1169478, level: 6 },
    양천구: { x: 37.520209, y: 126.852796, level: 6 },
    영등포구: { x: 37.5203655, y: 126.9107248, level: 6 },
    용산구: { x: 37.5350315, y: 126.9734515, level: 6 },
    은평구: { x: 37.606123, y: 126.922791, level: 6 },
    종로구: { x: 37.576556, y: 126.985472, level: 6 },
    중구: { x: 37.560997, y: 126.994728, level: 6 },
    중랑구: { x: 37.599295, y: 127.092336, level: 6 },
  },
  인천광역시: {
    중구: { x: 37.474797, y: 126.616519, level: 6 },
    동구: { x: 37.475482, y: 126.64336, level: 6 },
    남구: { x: 37.463707, y: 126.650783, level: 6 },
    연수구: { x: 37.410283, y: 126.678041, level: 6 },
    남동구: { x: 37.4474, y: 126.731737, level: 6 },
    부평구: { x: 37.507137, y: 126.721215, level: 6 },
    계양구: { x: 37.536725, y: 126.738829, level: 6 },
    서구: { x: 37.545378, y: 126.676873, level: 6 },
  },
  대전광역시: {
    서구: { x: 36.3544, y: 127.3836, level: 6 },
    유성구: { x: 36.3622, y: 127.3567, level: 6 },
    동구: { x: 36.327481, y: 127.447114, level: 6 },
    중구: { x: 36.325627, y: 127.423258, level: 6 },
    대덕구: { x: 36.373317, y: 127.414374, level: 6 },
  },
  부산광역시: {
    해운대구: { x: 35.1631006, y: 129.163018, level: 6 },
    남구: { x: 35.136532, y: 129.084272, level: 6 },
    동래구: { x: 35.205282, y: 129.083473, level: 6 },
    서구: { x: 35.097894, y: 129.025571, level: 6 },
    부산진구: { x: 35.159541, y: 129.059222, level: 6 },
    북구: { x: 35.209651, y: 129.034885, level: 6 },
    수영구: { x: 35.142255, y: 129.113826, level: 6 },
    연제구: { x: 35.176594, y: 129.078543, level: 6 },
    사상구: { x: 35.150318, y: 128.990603, level: 6 },
    사하구: { x: 35.097264, y: 128.970606, level: 6 },
    금정구: { x: 35.242354, y: 129.092487, level: 6 },
  },
  대구광역시: {
    중구: { x: 35.865288, y: 128.594813, level: 6 },
    동구: { x: 35.885019, y: 128.635522, level: 6 },
    서구: { x: 35.87139, y: 128.559022, level: 6 },
    남구: { x: 35.846673, y: 128.601445, level: 6 },
    북구: { x: 35.885666, y: 128.582702, level: 6 },
    수성구: { x: 35.858332, y: 128.630865, level: 6 },
    달서구: { x: 35.82942, y: 128.532436, level: 6 },
  },
  광주광역시: {
    동구: { x: 35.146071, y: 126.923867, level: 6 },
    서구: { x: 35.152663, y: 126.890999, level: 6 },
    남구: { x: 35.133092, y: 126.902281, level: 6 },
    북구: { x: 35.174694, y: 126.911352, level: 6 },
    광산구: { x: 35.139848, y: 126.793667, level: 6 },
  },
  울산광역시: {
    중구: { x: 35.569573, y: 129.332936, level: 6 },
    남구: { x: 35.543764, y: 129.330645, level: 6 },
    동구: { x: 35.482151, y: 129.420341, level: 6 },
    북구: { x: 35.582529, y: 129.361136, level: 6 },
    울주군: { x: 35.520744, y: 129.242903, level: 6 },
  },
  세종시: {
    세종시: { x: 36.49583, y: 127.258539, level: 7 },
  },
  경기도: {
    가평군: { x: 37.831493, y: 127.509327, level: 6 },
    고양시_덕양구: { x: 37.63722, y: 126.832942, level: 6 },
    고양시_일산동구: { x: 37.659313, y: 126.773739, level: 6 },
    고양시_일산서구: { x: 37.676849, y: 126.748104, level: 6 },
    과천시: { x: 37.429297, y: 126.987318, level: 7 },
    광명시: { x: 37.478406, y: 126.864364, level: 7 },
    광주시: { x: 37.429832, y: 127.255222, level: 7 },
    구리시: { x: 37.594371, y: 127.129603, level: 7 },
    군포시: { x: 37.361519, y: 126.935245, level: 7 },
    김포시: { x: 37.615392, y: 126.71537, level: 7 },
    남양주시: { x: 37.636596, y: 127.216348, level: 7 },
    동두천시: { x: 37.903808, y: 127.060051, level: 7 },
    부천시_소사구: { x: 37.482512, y: 126.799732, level: 6 },
    부천시_오정구: { x: 37.523541, y: 126.792183, level: 6 },
    부천시_원미구: { x: 37.504849, y: 126.787691, level: 6 },
    성남시_분당구: { x: 37.382362, y: 127.112397, level: 6 },
    성남시_수정구: { x: 37.440585, y: 127.137326, level: 6 },
    성남시_중원구: { x: 37.43106, y: 127.149509, level: 6 },
    수원시_권선구: { x: 37.257839, y: 126.970802, level: 6 },
    수원시_영통구: { x: 37.25923, y: 127.04707, level: 6 },
    수원시_장안구: { x: 37.305076, y: 127.010146, level: 6 },
    수원시_팔달구: { x: 37.284529, y: 127.043072, level: 6 },
    시흥시: { x: 37.379316, y: 126.803108, level: 7 },
    안산시_단원구: { x: 37.321897, y: 126.823576, level: 6 },
    안산시_상록구: { x: 37.302055, y: 126.869565, level: 6 },
    안성시: { x: 37.007969, y: 127.275635, level: 7 },
    안양시_동안구: { x: 37.394252, y: 126.95682, level: 6 },
    안양시_만안구: { x: 37.392695, y: 126.922318, level: 6 },
    양주시: { x: 37.785136, y: 127.04508, level: 7 },
    양평군: { x: 37.491783, y: 127.487341, level: 7 },
    여주시: { x: 37.298087, y: 127.637261, level: 7 },
    연천군: { x: 38.096238, y: 127.074453, level: 7 },
    오산시: { x: 37.149674, y: 127.077222, level: 7 },
    용인시_기흥구: { x: 37.276084, y: 127.108256, level: 6 },
    용인시_수지구: { x: 37.322117, y: 127.095918, level: 6 },
    용인시_처인구: { x: 37.214365, y: 127.209755, level: 6 },
    의왕시: { x: 37.344521, y: 126.968833, level: 7 },
    의정부시: { x: 37.738081, y: 127.033634, level: 7 },
    이천시: { x: 37.272559, y: 127.435117, level: 7 },
    파주시: { x: 37.759511, y: 126.780195, level: 7 },
    평택시: { x: 36.992115, y: 127.112917, level: 7 },
    포천시: { x: 37.89491, y: 127.200759, level: 7 },
    하남시: { x: 37.539287, y: 127.214577, level: 7 },
    화성시: { x: 37.199845, y: 126.831778, level: 7 },
  },
  강원도: {
    강릉시: { x: 37.752, y: 128.875, level: 7 },
    고성군: { x: 38.377, y: 128.468, level: 7 },
    동해시: { x: 37.515, y: 129.114, level: 7 },
    삼척시: { x: 37.444, y: 129.166, level: 7 },
    속초시: { x: 38.204, y: 128.566, level: 7 },
    양구군: { x: 38.106, y: 127.99, level: 7 },
    양양군: { x: 38.078, y: 128.618, level: 7 },
    영월군: { x: 37.181, y: 128.466, level: 7 },
    원주시: { x: 37.342, y: 127.92, level: 7 },
    인제군: { x: 38.069, y: 128.382, level: 7 },
    정선군: { x: 37.376, y: 128.665, level: 7 },
    철원군: { x: 38.205, y: 127.324, level: 7 },
    춘천시: { x: 37.881, y: 127.73, level: 7 },
    태백시: { x: 37.17, y: 128.987, level: 7 },
    평창군: { x: 37.37, y: 128.403, level: 7 },
    홍천군: { x: 37.704, y: 127.874, level: 7 },
    화천군: { x: 38.102, y: 127.707, level: 7 },
    횡성군: { x: 37.494, y: 127.991, level: 7 },
  },
  충청북도: {
    괴산군: { x: 36.815, y: 127.799, level: 7 },
    단양군: { x: 36.984, y: 128.365, level: 7 },
    보은군: { x: 36.489, y: 127.729, level: 7 },
    영동군: { x: 36.174, y: 127.776, level: 7 },
    옥천군: { x: 36.306, y: 127.57, level: 7 },
    음성군: { x: 36.94, y: 127.69, level: 7 },
    제천시: { x: 37.132, y: 128.19, level: 7 },
    증평군: { x: 36.785, y: 127.581, level: 7 },
    진천군: { x: 36.854, y: 127.435, level: 7 },
    청원군: { x: 36.643, y: 127.491, level: 7 },
    청주시_상당구: { x: 36.636, y: 127.502, level: 6 },
    청주시_흥덕구: { x: 36.642, y: 127.449, level: 6 },
    충주시: { x: 36.991, y: 127.926, level: 7 },
  },
  충청남도: {
    계룡시: { x: 36.274, y: 127.248, level: 7 },
    공주시: { x: 36.455, y: 127.124, level: 7 },
    금산군: { x: 36.108, y: 127.488, level: 7 },
    논산시: { x: 36.203, y: 127.085, level: 7 },
    당진시: { x: 36.891, y: 126.629, level: 7 },
    보령시: { x: 36.349, y: 126.615, level: 7 },
    부여군: { x: 36.275, y: 126.91, level: 7 },
    서산시: { x: 36.784, y: 126.45, level: 7 },
    서천군: { x: 36.077, y: 126.691, level: 7 },
    아산시: { x: 36.788, y: 127.001, level: 7 },
    연기군: { x: 36.555, y: 127.274, level: 7 },
    예산군: { x: 36.682, y: 126.848, level: 7 },
    천안시_동남구: { x: 36.798, y: 127.148, level: 6 },
    천안시_서북구: { x: 36.83, y: 127.113, level: 6 },
    청양군: { x: 36.46, y: 126.804, level: 7 },
    태안군: { x: 36.745, y: 126.298, level: 7 },
    홍성군: { x: 36.601, y: 126.662, level: 7 },
  },
  전라북도: {
    고창군: { x: 35.4352, y: 126.7022, level: 7 },
    군산시: { x: 35.9672, y: 126.7365, level: 7 },
    김제시: { x: 35.8038, y: 126.8886, level: 7 },
    남원시: { x: 35.4167, y: 127.3903, level: 7 },
    무주군: { x: 36.0081, y: 127.6603, level: 7 },
    부안군: { x: 35.731, y: 126.7333, level: 7 },
    순창군: { x: 35.3745, y: 127.1372, level: 7 },
    완주군: { x: 35.8429, y: 127.1621, level: 7 },
    익산시: { x: 35.9483, y: 126.9574, level: 7 },
    임실군: { x: 35.6174, y: 127.287, level: 7 },
    장수군: { x: 35.6471, y: 127.5215, level: 7 },
    전주시_덕진구: { x: 35.8504, y: 127.148, level: 6 },
    전주시_완산구: { x: 35.8138, y: 127.1217, level: 6 },
    정읍시: { x: 35.5695, y: 126.8577, level: 7 },
    진안군: { x: 35.7917, y: 127.424, level: 7 },
  },
  전라남도: {
    강진군: { x: 34.6428, y: 126.7694, level: 7 },
    고흥군: { x: 34.6057, y: 127.2856, level: 7 },
    곡성군: { x: 35.2815, y: 127.2911, level: 7 },
    광양시: { x: 34.9407, y: 127.6953, level: 7 },
    구례군: { x: 35.2025, y: 127.4626, level: 7 },
    나주시: { x: 35.0153, y: 126.7122, level: 7 },
    담양군: { x: 35.3217, y: 126.9872, level: 7 },
    목포시: { x: 34.8118, y: 126.392, level: 7 },
    무안군: { x: 34.9901, y: 126.481, level: 7 },
    보성군: { x: 34.7711, y: 127.0804, level: 7 },
    순천시: { x: 34.9506, y: 127.4875, level: 7 },
    신안군: { x: 34.8333, y: 125.9994, level: 7 },
    여수시: { x: 34.7604, y: 127.6622, level: 7 },
    영광군: { x: 35.2771, y: 126.5126, level: 7 },
    영암군: { x: 34.8006, y: 126.6961, level: 7 },
    완도군: { x: 34.3114, y: 126.7554, level: 7 },
    장성군: { x: 35.3019, y: 126.7843, level: 7 },
    장흥군: { x: 34.6814, y: 126.9044, level: 7 },
    진도군: { x: 34.4866, y: 126.2632, level: 7 },
    함평군: { x: 35.0651, y: 126.5165, level: 7 },
    해남군: { x: 34.5743, y: 126.598, level: 7 },
    화순군: { x: 35.0635, y: 127.0208, level: 7 },
  },
  경상북도: {
    경산시: { x: 35.8252, y: 128.7415, level: 7 },
    경주시: { x: 35.8562, y: 129.2247, level: 7 },
    고령군: { x: 35.7283, y: 128.2638, level: 7 },
    구미시: { x: 36.1195, y: 128.3446, level: 7 },
    군위군: { x: 36.2394, y: 128.5728, level: 7 },
    김천시: { x: 36.139, y: 128.1136, level: 7 },
    문경시: { x: 36.5864, y: 128.1857, level: 7 },
    봉화군: { x: 36.8937, y: 128.7326, level: 7 },
    상주시: { x: 36.4101, y: 128.1587, level: 7 },
    성주군: { x: 35.9193, y: 128.2825, level: 7 },
    안동시: { x: 36.5684, y: 128.7294, level: 7 },
    영덕군: { x: 36.4155, y: 129.3657, level: 7 },
    영양군: { x: 36.6648, y: 129.112, level: 7 },
    영주시: { x: 36.8057, y: 128.6246, level: 7 },
    영천시: { x: 35.9733, y: 128.9385, level: 7 },
    예천군: { x: 36.6557, y: 128.4527, level: 7 },
    울릉군: { x: 37.4792, y: 130.9057, level: 7 },
    울진군: { x: 36.993, y: 129.4008, level: 7 },
    의성군: { x: 36.3526, y: 128.6972, level: 7 },
    청도군: { x: 35.6478, y: 128.7345, level: 7 },
    청송군: { x: 36.4366, y: 129.0577, level: 7 },
    칠곡군: { x: 36.0214, y: 128.4014, level: 7 },
    포항시_남구: { x: 35.9677, y: 129.3849, level: 7 },
    포항시_북구: { x: 36.0193, y: 129.3435, level: 7 },
  },
  경상남도: {
    거제시: { x: 34.8803, y: 128.6219, level: 7 },
    거창군: { x: 35.688, y: 127.9091, level: 7 },
    고성군: { x: 34.9721, y: 128.3227, level: 7 },
    김해시: { x: 35.2285, y: 128.8895, level: 7 },
    남해군: { x: 34.837, y: 127.8923, level: 7 },
    밀양시: { x: 35.5035, y: 128.7465, level: 7 },
    사천시: { x: 35.0038, y: 128.0645, level: 7 },
    산청군: { x: 35.4153, y: 127.8783, level: 7 },
    양산시: { x: 35.335, y: 129.0371, level: 7 },
    의령군: { x: 35.3223, y: 128.2613, level: 7 },
    진주시: { x: 35.1802, y: 128.1076, level: 7 },
    창녕군: { x: 35.543, y: 128.4923, level: 7 },
    창원시_마산합포구: { x: 35.2023, y: 128.5768, level: 6 },
    창원시_마산회원구: { x: 35.2241, y: 128.5833, level: 6 },
    창원시_성산구: { x: 35.2186, y: 128.6802, level: 6 },
    창원시_의창구: { x: 35.283, y: 128.6401, level: 6 },
    창원시_진해구: { x: 35.1499, y: 128.7145, level: 6 },
    통영시: { x: 34.8557, y: 128.4336, level: 7 },
    하동군: { x: 35.0675, y: 127.7516, level: 7 },
    함안군: { x: 35.2727, y: 128.406, level: 7 },
    함양군: { x: 35.5207, y: 127.7251, level: 7 },
    합천군: { x: 35.5668, y: 128.1658, level: 7 },
  },
  제주도: {
    서귀포시: { x: 33.253, y: 126.5617, level: 7 },
    제주시: { x: 33.4996, y: 126.5312, level: 7 },
  },
}

let location = ref(null)

const setLocation = function () {
  if (geoLocation[city.value] && geoLocation[city.value][district.value]) {
    location.value = geoLocation[city.value][district.value]
    emit('setLocation', location.value, brand.value)
  } else {
    console.error('위치 정보를 찾을 수 없습니다.')
  }
}

// 도시가 변경되면 구/군 정보 초기화
watch(city, () => {
  district.value = ''
})
</script>

<style scoped>
.form-select {
  width: 180px;
  height: 50px;
  margin-bottom: 50px;
  border: 1px solid #3f72af;
}
.btn {
  color: white;
  background-color: #3f72af;
  margin-left: 23%;
  width: 50%;
}
</style>
